tap "aws/tap"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "int128/kubelogin"
tap "jesseduffield/lazygit"

brew "act"
brew "python@3.13"
brew "asciinema"
brew "aws-sam-cli"
brew "awscli"
brew "azcopy"
brew "azure-cli"
brew "bandwhich"
brew "bash"
brew "bash-completion"
brew "bat"
brew "binutils"
brew "bit-git"
brew "brew-cask-completion"
brew "freetype"
brew "glib"
brew "checkov"
brew "clang-format"
brew "colima"
brew "coreutils"
brew "croc"
brew "diffutils"
brew "docker", link: false
brew "dotbot"
brew "gnutls"
brew "emacs"
brew "eza"
brew "f2"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gdbm"
brew "gh"
brew "git"
brew "git-gui"
brew "git-remote-codecommit"
brew "git-secret"
brew "glances"
brew "glow"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "golangci-lint"
brew "gpatch"
brew "gpgme"
brew "gpg-tui"
brew "grep"
brew "gzip"
brew "helm"
brew "htop"
brew "httpie"
brew "iproute2mac"
brew "ipython"
brew "jq"
brew "jrnl"
brew "k3d"
brew "k9s"
brew "kubecolor"
brew "kubernetes-cli"
brew "kubectx"
brew "kubelogin"
brew "less"
brew "libheif"
brew "libomp"
brew "lnav"
brew "m4"
brew "make"
brew "mas"
brew "maven"
brew "minikube"
brew "mtr"
brew "nano"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "node"
brew "nvm"
brew "parallel"
brew "poetry"
brew "pre-commit"
brew "procs"
brew "protobuf"
brew "pv"
brew "pwgen"
brew "ranger"
brew "ripgrep"
brew "screen"
brew "shellcheck"
brew "shfmt"
brew "smartmontools"
brew "starship"
brew "stow"
brew "tcping"
brew "telnet"
brew "terminal-notifier"
brew "terraform"
brew "terraform-docs"
brew "tflint"
brew "thefuck"
brew "tldr"
brew "tmate"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "virtualenv"
brew "virtualenvwrapper"
brew "w3m"
brew "watch"
brew "wget"
brew "yapf"
brew "yazi"
brew "yh"
brew "ykman"
brew "yq"
brew "zsh"
brew "zsh-completions"
brew "aws/tap/copilot-cli"
brew "jesseduffield/lazygit/lazygit"

cask "aws-vault"
cask "cheatsheet"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "iterm2"
cask "openinterminal"
cask "openlens"
cask "visual-studio-code"
cask "wezterm"
